AWorksOpen/aw_m1052/aworks_sdk/source/imxrt10xx_common/board/imxrt105x/cpu/include/imx1050_iomuxc_regs.h
/*******************************************************************************
*                                 AWorks
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2012 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief 定义iMX RT1050 IOMUXC相关的寄存器结构体
 *
 * \internal
 * \par modification history:
 * - 1.00 17-10-12  mex, first implementation
 * \endinternal
 */

#ifndef __IMX1050_IOMUXC_REGS_H
#define __IMX1050_IOMUXC_REGS_H

#include "aworks.h"

#ifdef __cplusplus
extern "C" {
#endif  /* __cplusplus  */


#pragma pack(push)
#pragma pack(1)
typedef struct {

    volatile uint32_t IOMUXC_GPR_GPR0;
    volatile uint32_t IOMUXC_GPR_GPR1;
    volatile uint32_t IOMUXC_GPR_GPR2;
    volatile uint32_t IOMUXC_GPR_GPR3;
    volatile uint32_t IOMUXC_GPR_GPR4;
    volatile uint32_t IOMUXC_GPR_GPR5;
    volatile uint32_t IOMUXC_GPR_GPR6;
    volatile uint32_t IOMUXC_GPR_GPR7;
    volatile uint32_t IOMUXC_GPR_GPR8;
    volatile uint32_t IOMUXC_GPR_GPR9;
    volatile uint32_t IOMUXC_GPR_GPR10;
    volatile uint32_t IOMUXC_GPR_GPR11;
    volatile uint32_t IOMUXC_GPR_GPR12;
    volatile uint32_t IOMUXC_GPR_GPR13;
    volatile uint32_t IOMUXC_GPR_GPR14;
    volatile uint32_t IOMUXC_GPR_GPR15;
    volatile uint32_t IOMUXC_GPR_GPR16;
    volatile uint32_t IOMUXC_GPR_GPR17;
    volatile uint32_t IOMUXC_GPR_GPR18;
    volatile uint32_t IOMUXC_GPR_GPR19;
    volatile uint32_t IOMUXC_GPR_GPR20;
    volatile uint32_t IOMUXC_GPR_GPR21;
    volatile uint32_t IOMUXC_GPR_GPR22;
    volatile uint32_t IOMUXC_GPR_GPR23;
    volatile uint32_t IOMUXC_GPR_GPR24;
    volatile uint32_t IOMUXC_GPR_GPR25;
    volatile uint32_t IOMUXC_GPR_GPR26;
} hw_iomuxc_gpr_regs_t;

typedef struct {

    volatile uint32_t reserved[5];
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_00;      /* offset 0x0014 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_01;      /* offset 0x0018 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_02;      /* offset 0x001C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_03;      /* offset 0x0020 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_04;      /* offset 0x0024 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_05;      /* offset 0x0028 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_06;      /* offset 0x002C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_07;      /* offset 0x0030 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_08;      /* offset 0x0034 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_09;      /* offset 0x0038 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_10;      /* offset 0x003C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_11;      /* offset 0x0040 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_12;      /* offset 0x0044 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_13;      /* offset 0x0048 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_14;      /* offset 0x004C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_15;      /* offset 0x0050 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_16;      /* offset 0x0054 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_17;      /* offset 0x0058 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_18;      /* offset 0x005C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_19;      /* offset 0x0060 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_20;      /* offset 0x0064 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_21;      /* offset 0x0068 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_22;      /* offset 0x006C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_23;      /* offset 0x0070 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_24;      /* offset 0x0074 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_25;      /* offset 0x0078 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_26;      /* offset 0x007C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_27;      /* offset 0x0080 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_28;      /* offset 0x0084 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_29;      /* offset 0x0088 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_30;      /* offset 0x008C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_31;      /* offset 0x0090 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_32;      /* offset 0x0094 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_33;      /* offset 0x0098 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_34;      /* offset 0x009C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_35;      /* offset 0x00A0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_36;      /* offset 0x00A4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_37;      /* offset 0x00A8 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_38;      /* offset 0x00AC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_39;      /* offset 0x00B0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_40;      /* offset 0x00B4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_EMC_41;      /* offset 0x00B8 */

    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_00;    /* offset 0x00BC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_01;    /* offset 0x00C0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_02;    /* offset 0x00C4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_03;    /* offset 0x00C8 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_04;    /* offset 0x00CC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_05;    /* offset 0x00D0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_06;    /* offset 0x00D4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_07;    /* offset 0x00D8 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_08;    /* offset 0x00DC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_09;    /* offset 0x00E0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_10;    /* offset 0x00E4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_11;    /* offset 0x00E8 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_12;    /* offset 0x00EC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_13;    /* offset 0x00F0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_14;    /* offset 0x00F4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B0_15;    /* offset 0x00F8 */

    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_00;    /* offset 0x00FC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_01;    /* offset 0x0100 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_02;    /* offset 0x0104 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_03;    /* offset 0x0108 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_04;    /* offset 0x010C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_05;    /* offset 0x0110 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_06;    /* offset 0x0114 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_07;    /* offset 0x0118 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_08;    /* offset 0x011C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_09;    /* offset 0x0120 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_10;    /* offset 0x0124 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_11;    /* offset 0x0128 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_12;    /* offset 0x012C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_13;    /* offset 0x0130 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_14;    /* offset 0x0134 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_AD_B1_15;    /* offset 0x0138 */

    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_00;       /* offset 0x013C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_01;       /* offset 0x0140 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_02;       /* offset 0x0144 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_03;       /* offset 0x0148 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_04;       /* offset 0x014C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_05;       /* offset 0x0150 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_06;       /* offset 0x0154 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_07;       /* offset 0x0158 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_08;       /* offset 0x015C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_09;       /* offset 0x0160 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_10;       /* offset 0x0164 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_11;       /* offset 0x0168 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_12;       /* offset 0x016C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_13;       /* offset 0x0170 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_14;       /* offset 0x0174 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B0_15;       /* offset 0x0178 */

    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_00;       /* offset 0x017C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_01;       /* offset 0x0180 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_02;       /* offset 0x0184 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_03;       /* offset 0x0188 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_04;       /* offset 0x018C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_05;       /* offset 0x0190 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_06;       /* offset 0x0194 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_07;       /* offset 0x0198 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_08;       /* offset 0x019C */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_09;       /* offset 0x01A0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_10;       /* offset 0x01A4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_11;       /* offset 0x01A8 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_12;       /* offset 0x01AC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_13;       /* offset 0x01B0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_14;       /* offset 0x01B4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_B1_15;       /* offset 0x01B8 */

    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_00;   /* offset 0x01BC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_01;   /* offset 0x01C0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_02;   /* offset 0x01C4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_03;   /* offset 0x01C8 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_04;   /* offset 0x01CC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B0_05;   /* offset 0x01D0 */

    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_00;   /* offset 0x01D4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_01;   /* offset 0x01D8 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_02;   /* offset 0x01DC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_03;   /* offset 0x01E0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_04;   /* offset 0x01E4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_05;   /* offset 0x01E8 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_06;   /* offset 0x01EC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_07;   /* offset 0x01F0 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_08;   /* offset 0x01F4 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_09;   /* offset 0x01F8 */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_10;   /* offset 0x01FC */
    volatile uint32_t SW_MUX_CTL_PAD_GPIO_SD_B1_11;   /* offset 0x0200 */

