AWorksOpen/aw_m1052/aworks_sdk/source/imxrt10xx_common/board/imxrt105x/cpu/include/imx1050_iomuxc_regs.h
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_00;     /* offset 0x0204 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_01;     /* offset 0x0208 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_02;     /* offset 0x020C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_03;     /* offset 0x0210 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_04;     /* offset 0x0214 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_05;     /* offset 0x0218 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_06;     /* offset 0x021C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_07;     /* offset 0x0220 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_08;     /* offset 0x0224 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_09;     /* offset 0x0228 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_10;     /* offset 0x022C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_11;     /* offset 0x0230 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_12;     /* offset 0x0234 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_13;     /* offset 0x0238 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_14;     /* offset 0x023C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_15;     /* offset 0x0240 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_16;     /* offset 0x0244 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_17;     /* offset 0x0248 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_18;     /* offset 0x024C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_19;     /* offset 0x0250 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_20;     /* offset 0x0254 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_21;     /* offset 0x0258 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_22;     /* offset 0x025C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_23;     /* offset 0x0260 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_24;     /* offset 0x0264 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_25;     /* offset 0x0268 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_26;     /* offset 0x026C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_27;     /* offset 0x0270 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_28;     /* offset 0x0274 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_29;     /* offset 0x0278 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_30;     /* offset 0x027C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_31;     /* offset 0x0280 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_32;     /* offset 0x0284 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_33;     /* offset 0x0288 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_34;     /* offset 0x028C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_35;     /* offset 0x0290 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_36;     /* offset 0x0294 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_37;     /* offset 0x0298 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_38;     /* offset 0x029C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_39;     /* offset 0x02A0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_40;     /* offset 0x02A4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_EMC_41;     /* offset 0x02A8 */

    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_00;   /* offset 0x02AC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_01;   /* offset 0x02B0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_02;   /* offset 0x02B4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_03;   /* offset 0x02B8 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_04;   /* offset 0x02BC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_05;   /* offset 0x02C0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_06;   /* offset 0x02C4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_07;   /* offset 0x02C8 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_08;   /* offset 0x02CC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_09;   /* offset 0x02D0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_10;   /* offset 0x02D4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_11;   /* offset 0x02D8 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_12;   /* offset 0x02DC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_13;   /* offset 0x02E0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_14;   /* offset 0x02E4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B0_15;   /* offset 0x02E8 */

    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_00;   /* offset 0x02EC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_01;   /* offset 0x02F0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_02;   /* offset 0x02F4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_03;   /* offset 0x02F8 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_04;   /* offset 0x02FC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_05;   /* offset 0x0300 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_06;   /* offset 0x0304 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_07;   /* offset 0x0308 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_08;   /* offset 0x030C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_09;   /* offset 0x0310 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_10;   /* offset 0x0314 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_11;   /* offset 0x0318 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_12;   /* offset 0x031C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_13;   /* offset 0x0320 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_14;   /* offset 0x0324 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_AD_B1_15;   /* offset 0x0328 */

    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_00;      /* offset 0x032C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_01;      /* offset 0x0330 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_02;      /* offset 0x0334 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_03;      /* offset 0x0338 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_04;      /* offset 0x033C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_05;      /* offset 0x0340 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_06;      /* offset 0x0344 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_07;      /* offset 0x0348 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_08;      /* offset 0x034C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_09;      /* offset 0x0350 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_10;      /* offset 0x0354 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_11;      /* offset 0x0358 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_12;      /* offset 0x035C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_13;      /* offset 0x0360 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_14;      /* offset 0x0364 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B0_15;      /* offset 0x0368 */

    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_00;      /* offset 0x036C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_01;      /* offset 0x0370 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_02;      /* offset 0x0374 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_03;      /* offset 0x0378 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_04;      /* offset 0x037C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_05;      /* offset 0x0380 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_06;      /* offset 0x0384 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_07;      /* offset 0x0388 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_08;      /* offset 0x038C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_09;      /* offset 0x0390 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_10;      /* offset 0x0394 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_11;      /* offset 0x0398 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_12;      /* offset 0x039C */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_13;      /* offset 0x03A0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_14;      /* offset 0x03A4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_B1_15;      /* offset 0x03A8 */

    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_00;   /* offset 0x03AC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_01;   /* offset 0x03B0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_02;   /* offset 0x03B4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_03;   /* offset 0x03B8 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_04;   /* offset 0x03BC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B0_05;   /* offset 0x03C0*/

    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_00;   /* offset 0x03C4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_01;   /* offset 0x03C8 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_02;   /* offset 0x03CC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_03;   /* offset 0x03D0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_04;   /* offset 0x03D4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_05;   /* offset 0x03D8 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_06;   /* offset 0x03DC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_07;   /* offset 0x03E0 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_08;   /* offset 0x03E4 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_09;   /* offset 0x03E8 */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_10;   /* offset 0x03EC */
    volatile uint32_t SW_PAD_CTL_PAD_GPIO_SD_B1_11;   /* offset 0x03F0 */

    volatile uint32_t USB_OTG1_ID_SELECT_INPUT;       /* offset 0x03F4 */
    volatile uint32_t USB_OTG2_ID_SELECT_INPUT;       /* offset 0x03F8 */
    volatile uint32_t CCM_PMIC_READY_SELECT_INPUT;    /* offset 0x03FC */

    volatile uint32_t CSI_DATA02_SELECT_INPUT;        /* offset 0x0400 */
    volatile uint32_t CSI_DATA03_SELECT_INPUT;        /* offset 0x0404 */
    volatile uint32_t CSI_DATA04_SELECT_INPUT;        /* offset 0x0408 */
    volatile uint32_t CSI_DATA05_SELECT_INPUT;        /* offset 0x040C */
    volatile uint32_t CSI_DATA06_SELECT_INPUT;        /* offset 0x0410 */
    volatile uint32_t CSI_DATA07_SELECT_INPUT;        /* offset 0x0414 */
    volatile uint32_t CSI_DATA08_SELECT_INPUT;        /* offset 0x0418 */
    volatile uint32_t CSI_DATA09_SELECT_INPUT;        /* offset 0x041C */

