AWorksOpen/aw_m1052/aworks_sdk/source/imxrt10xx_common/board/imxrt105x/cpu/include/imx1050_iomuxc_regs.h
    volatile uint32_t CSI_HSYNC_SELECT_INPUT;         /* offset 0x0420 */
    volatile uint32_t CSI_PIXCLK_SELECT_INPUT;        /* offset 0x0424 */
    volatile uint32_t CSI_VSYNC_SELECT_INPUT;         /* offset 0x0428 */
    volatile uint32_t ENET_IPG_CLK_RMII_SELECT_INPUT; /* offset 0x042C */
    volatile uint32_t ENET_MDIO_SELECT_INPUT;         /* offset 0x0430 */
    volatile uint32_t ENET0_RXDATA_SELECT_INPUT;      /* offset 0x0434 */
    volatile uint32_t ENET1_RXDATA_SELECT_INPUT;      /* offset 0x0438 */
    volatile uint32_t ENET_RXEN_SELECT_INPUT;         /* offset 0x043C */
    volatile uint32_t ENET_RXERR_SELECT_INPUT;        /* offset 0x0440 */
    volatile uint32_t ENET0_TIMER_SELECT_INPUT;       /* offset 0x0444 */
    volatile uint32_t ENET_TXCLK_SELECT_INPUT;        /* offset 0x0448 */
    volatile uint32_t FLEXCAN1_RX_SELECT_INPUT;       /* offset 0x044C */
    volatile uint32_t FLEXCAN2_RX_SELECT_INPUT;       /* offset 0x0450 */

    volatile uint32_t FLEXPWM1_PWMA3_SELECT_INPUT;    /* offset 0x0454 */
    volatile uint32_t FLEXPWM1_PWMA0_SELECT_INPUT;    /* offset 0x0458 */
    volatile uint32_t FLEXPWM1_PWMA1_SELECT_INPUT;    /* offset 0x045C */
    volatile uint32_t FLEXPWM1_PWMA2_SELECT_INPUT;    /* offset 0x0460 */
    volatile uint32_t FLEXPWM1_PWMB3_SELECT_INPUT;    /* offset 0x0464 */
    volatile uint32_t FLEXPWM1_PWMB0_SELECT_INPUT;    /* offset 0x0468 */
    volatile uint32_t FLEXPWM1_PWMB1_SELECT_INPUT;    /* offset 0x046C */
    volatile uint32_t FLEXPWM1_PWMB2_SELECT_INPUT;    /* offset 0x0470 */

    volatile uint32_t FLEXPWM2_PWMA3_SELECT_INPUT;    /* offset 0x0474 */
    volatile uint32_t FLEXPWM2_PWMA0_SELECT_INPUT;    /* offset 0x0478 */
    volatile uint32_t FLEXPWM2_PWMA1_SELECT_INPUT;    /* offset 0x047C */
    volatile uint32_t FLEXPWM2_PWMA2_SELECT_INPUT;    /* offset 0x0480 */
    volatile uint32_t FLEXPWM2_PWMB3_SELECT_INPUT;    /* offset 0x0484 */
    volatile uint32_t FLEXPWM2_PWMB0_SELECT_INPUT;    /* offset 0x0488 */
    volatile uint32_t FLEXPWM2_PWMB1_SELECT_INPUT;    /* offset 0x048C */
    volatile uint32_t FLEXPWM2_PWMB2_SELECT_INPUT;    /* offset 0x0490 */
    volatile uint32_t FLEXPWM4_PWMA0_SELECT_INPUT;    /* offset 0x0494 */
    volatile uint32_t FLEXPWM4_PWMA1_SELECT_INPUT;    /* offset 0x0498 */
    volatile uint32_t FLEXPWM4_PWMA2_SELECT_INPUT;    /* offset 0x049C */
    volatile uint32_t FLEXPWM4_PWMA3_SELECT_INPU;     /* offset 0x04A0 */
    volatile uint32_t FLEXSPIA_DQS_SELECT_INPUT;      /* offset 0x04A4 */

    volatile uint32_t FLEXSPIA_DATA0_SELECT_INPUT;    /* offset 0x04A8 */
    volatile uint32_t FLEXSPIA_DATA1_SELECT_INPUT;    /* offset 0x04AC */
    volatile uint32_t FLEXSPIA_DATA2_SELECT_INPUT;    /* offset 0x04B0 */
    volatile uint32_t FLEXSPIA_DATA3_SELECT_INPUT;    /* offset 0x04B4 */

    volatile uint32_t FLEXSPIB_DATA0_SELECT_INPUT;    /* offset 0x04B8 */
    volatile uint32_t FLEXSPIB_DATA1_SELECT_INPUT;    /* offset 0x04BC */
    volatile uint32_t FLEXSPIB_DATA2_SELECT_INPUT;    /* offset 0x04C0 */
    volatile uint32_t FLEXSPIB_DATA3_SELECT_INPUT;    /* offset 0x04C4 */

    volatile uint32_t FLEXSPIA_SCK_SELECT_INPUT;      /* offset 0x04C8 */
    volatile uint32_t LPI2C1_SCL_SELECT_INPUT;        /* offset 0x04CC */
    volatile uint32_t LPI2C1_SDA_SELECT_INPU;         /* offset 0x04D0 */
    volatile uint32_t LPI2C2_SCL_SELECT_INPUT;        /* offset 0x04D4 */
    volatile uint32_t LPI2C2_SDA_SELECT_INPUT;        /* offset 0x04D8 */
    volatile uint32_t LPI2C3_SCL_SELECT_INPUT;        /* offset 0x04DC */
    volatile uint32_t LPI2C3_SDA_SELECT_INPUT;        /* offset 0x04E0 */
    volatile uint32_t LPI2C4_SCL_SELECT_INPUT;        /* offset 0x04E4 */
    volatile uint32_t LPI2C4_SDA_SELECT_INPU;         /* offset 0x04E8 */
    volatile uint32_t LPSPI1_PCS0_SELECT_INPUT;       /* offset 0x04EC */
    volatile uint32_t LPSPI1_SCK_SELECT_INPUT;        /* offset 0x04F0 */
    volatile uint32_t LPSPI1_SDI_SELECT_INPUT;        /* offset 0x04F4 */
    volatile uint32_t LPSPI1_SDO_SELECT_INPUT;        /* offset 0x04F8 */
    volatile uint32_t LPSPI2_PCS0_SELECT_INPUT;       /* offset 0x04FC */
    volatile uint32_t LPSPI2_SCK_SELECT_INPUT;        /* offset 0x0500 */
    volatile uint32_t LPSPI2_SDI_SELECT_INPUT;        /* offset 0x0504 */
    volatile uint32_t LPSPI2_SDO_SELECT_INPUT;        /* offset 0x0508 */

    volatile uint32_t LPSPI3_PCS0_SELECT_INPUT;       /* offset 0x050C */
    volatile uint32_t LPSPI3_SCK_SELECT_INPUT;        /* offset 0x0510 */
    volatile uint32_t LPSPI3_SDI_SELECT_INPUT;        /* offset 0x0514 */
    volatile uint32_t LPSPI3_SDO_SELECT_INPUT;        /* offset 0x0518 */
    volatile uint32_t LPSPI4_PCS0_SELECT_INPUT;       /* offset 0x051C */
    volatile uint32_t LPSPI4_SCK_SELECT_INPUT;        /* offset 0x0520 */
    volatile uint32_t LPSPI4_SDI_SELECT_INPUT;        /* offset 0x0524 */
    volatile uint32_t LPSPI4_SDO_SELECT_INPUT;        /* offset 0x0528 */

    volatile uint32_t LPUART2_RX_SELECT_INPUT;        /* offset 0x052C */
    volatile uint32_t LPUART2_TX_SELECT_INPUT;        /* offset 0x0530 */
    volatile uint32_t LPUART3_CTS_B_SELECT_INPUT;     /* offset 0x0534 */
    volatile uint32_t LPUART3_RX_SELECT_INPUT;        /* offset 0x0538 */
    volatile uint32_t LPUART3_TX_SELECT_INPUT;        /* offset 0x053C */
    volatile uint32_t LPUART4_RX_SELECT_INPUT;        /* offset 0x0540 */
    volatile uint32_t LPUART4_TX_SELECT_INPUT;        /* offset 0x0544 */
    volatile uint32_t LPUART5_RX_SELECT_INPUT;        /* offset 0x0548 */
    volatile uint32_t LPUART5_TX_SELECT_INPUT;        /* offset 0x054C */
    volatile uint32_t LPUART6_RX_SELECT_INPUT;        /* offset 0x0550 */
    volatile uint32_t LPUART6_TX_SELECT_INPUT;        /* offset 0x0554 */
    volatile uint32_t LPUART7_RX_SELECT_INPUT;        /* offset 0x0558 */
    volatile uint32_t LPUART7_TX_SELECT_INPUT;        /* offset 0x055C */
    volatile uint32_t LPUART8_RX_SELECT_INPUT;        /* offset 0x0560 */
    volatile uint32_t LPUART8_TX_SELECT_INPUT;        /* offset 0x0564 */

