AWorksOpen/aw_m1052/aworks_sdk/source/imxrt10xx_common/board/imxrt105x/cpu/include/imx1050_iomuxc_regs.h
    volatile uint32_t NMI_SELECT_INPUT;               /* offset 0x0568 */

    volatile uint32_t QTIMER2_TIMER0_SELECT_INPUT;    /* offset 0x056C */
    volatile uint32_t QTIMER2_TIMER1_SELECT_INPUT;    /* offset 0x0570 */
    volatile uint32_t QTIMER2_TIMER2_SELECT_INPUT;    /* offset 0x0574 */
    volatile uint32_t QTIMER2_TIMER3_SELECT_INPUT;    /* offset 0x0578 */

    volatile uint32_t QTIMER3_TIMER0_SELECT_INPUT;    /* offset 0x057C */
    volatile uint32_t QTIMER3_TIMER1_SELECT_INPUT;    /* offset 0x0580 */
    volatile uint32_t QTIMER3_TIMER2_SELECT_INPUT;    /* offset 0x0584 */
    volatile uint32_t QTIMER3_TIMER3_SELECT_INPUT;    /* offset 0x0588 */

    volatile uint32_t SAI1_MCLK2_SELECT_INPUT;        /* offset 0x058C */
    volatile uint32_t SAI1_RX_BCLK_SELECT_INPUT;      /* offset 0x0590 */
    volatile uint32_t SAI1_RX_DATA0_SELECT_INPUT;     /* offset 0x0594 */
    volatile uint32_t SAI1_RX_DATA1_SELECT_INPUT;     /* offset 0x0598 */
    volatile uint32_t SAI1_RX_DATA2_SELECT_INPUT;     /* offset 0x059C */
    volatile uint32_t SAI1_RX_DATA3_SELECT_INPUT;     /* offset 0x05A0 */
    volatile uint32_t SAI1_RX_SYNC_SELECT_INPUT;      /* offset 0x05A4 */
    volatile uint32_t SAI1_TX_BCLK_SELECT_INPUT;      /* offset 0x05A8 */
    volatile uint32_t SAI1_TX_SYNC_SELECT_INPUT;      /* offset 0x05AC */

    volatile uint32_t SAI2_MCLK2_SELECT_INPUT;        /* offset 0x05B0 */
    volatile uint32_t SAI2_RX_BCLK_SELECT_INPUT;      /* offset 0x05B4 */
    volatile uint32_t SAI2_RX_DATA0_SELECT_INPUT;     /* offset 0x05B8 */
    volatile uint32_t SAI2_RX_SYNC_SELECT_INPUT;      /* offset 0x05BC */
    volatile uint32_t SAI2_TX_BCLK_SELECT_INPUT;      /* offset 0x05C0 */
    volatile uint32_t SAI2_TX_SYNC_SELECT_INPUT;      /* offset 0x05C4 */

    volatile uint32_t SPDIF_IN_SELECT_INPUT;          /* offset 0x05C8 */

    volatile uint32_t USB_OTG2_OC_SELECT_INPUT;       /* offset 0x05CC */
    volatile uint32_t USB_OTG1_OC_SELECT_INPUT;       /* offset 0x05D0 */

    volatile uint32_t USDHC1_CD_B_SELECT_INPUT;       /* offset 0x05D4 */
    volatile uint32_t USDHC1_WP_SELECT_INPUT;         /* offset 0x05D8 */
    volatile uint32_t USDHC2_CLK_SELECT_INPUT;        /* offset 0x05DC */
    volatile uint32_t USDHC2_CD_B_SELECT_INPUT;       /* offset 0x05E0 */
    volatile uint32_t USDHC2_CMD_SELECT_INPUT;        /* offset 0x05E4 */

    volatile uint32_t USDHC2_DATA0_SELECT_INPUT;      /* offset 0x05E8 */
    volatile uint32_t USDHC2_DATA1_SELECT_INPUT;      /* offset 0x05EC */
    volatile uint32_t USDHC2_DATA2_SELECT_INPUT;      /* offset 0x05F0 */
    volatile uint32_t USDHC2_DATA3_SELECT_INPUT;      /* offset 0x05F4 */
    volatile uint32_t USDHC2_DATA4_SELECT_INPUT;      /* offset 0x05F8 */
    volatile uint32_t USDHC2_DATA5_SELECT_INPUT;      /* offset 0x05FC */
    volatile uint32_t USDHC2_DATA6_SELECT_INPUT;      /* offset 0x0600 */
    volatile uint32_t USDHC2_DATA7_SELECT_INPUT;      /* offset 0x0604 */

    volatile uint32_t USDHC2_WP_SELECT_INPUT;         /* offset 0x0608 */

    volatile uint32_t XBAR1_IN02_SELECT_INPUT;        /* offset 0x060C */
    volatile uint32_t XBAR1_IN03_SELECT_INPUT;        /* offset 0x0610 */
    volatile uint32_t XBAR1_IN04_SELECT_INPUT;        /* offset 0x0614 */
    volatile uint32_t XBAR1_IN05_SELECT_INPUT;        /* offset 0x0618 */
    volatile uint32_t XBAR1_IN06_SELECT_INPUT;        /* offset 0x061C */
    volatile uint32_t XBAR1_IN07_SELECT_INPUT;        /* offset 0x0620 */
    volatile uint32_t XBAR1_IN08_SELECT_INPUT;        /* offset 0x0624 */
    volatile uint32_t XBAR1_IN09_SELECT_INPUT;        /* offset 0x0628 */

    volatile uint32_t XBAR1_IN17_SELECT_INPUT;        /* offset 0x062C */
    volatile uint32_t XBAR1_IN18_SELECT_INPUT;        /* offset 0x0630 */
    volatile uint32_t XBAR1_IN20_SELECT_INPUT;        /* offset 0x0634 */
    volatile uint32_t XBAR1_IN22_SELECT_INPUT;        /* offset 0x0638 */
    volatile uint32_t XBAR1_IN23_SELECT_INPUT;        /* offset 0x063C */
    volatile uint32_t XBAR1_IN24_SELECT_INPUT;        /* offset 0x0640 */

    volatile uint32_t XBAR1_IN14_SELECT_INPUT;        /* offset 0x0644 */
    volatile uint32_t XBAR1_IN15_SELECT_INPUT;        /* offset 0x0648 */
    volatile uint32_t XBAR1_IN16_SELECT_INPUT;        /* offset 0x064C */
    volatile uint32_t XBAR1_IN25_SELECT_INPUT;        /* offset 0x0650 */
    volatile uint32_t XBAR1_IN19_SELECT_INPUT;        /* offset 0x0654 */
    volatile uint32_t XBAR1_IN21_SELECT_INPUT;        /* offset 0x0658 */


} hw_iomuxc_regs_t;

typedef struct {

    volatile uint32_t SNVS_SW_MUX_CTL_PAD_WAKEUP;          /* offset 0x00 */
    volatile uint32_t SNVS_SW_MUX_CTL_PAD_PMIC_ON_REQ;     /* offset 0x04 */
    volatile uint32_t SNVS_SW_MUX_CTL_PAD_PMIC_STBY_REQ;   /* offset 0x08 */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_TEST_MODE;       /* offset 0x0C */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_POR_B;           /* offset 0x10 */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_ONOFF;           /* offset 0x14 */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_WAKEUP;          /* offset 0x18 */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_PMIC_ON_REQ;     /* offset 0x1C */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_PMIC_STBY_REQ;   /* offset 0x20 */

} hw_iomuxc_snvs_regs_t;

#pragma pack(pop)



#ifdef __cplusplus
}
#endif  /* __cplusplus  */

#endif  /* __IMX6UL_IOMUXC_REGS_H */

/* end of file */
